cloudlab_scripts/mongo_journal_benchmark/load10000.out
mongo client connection created with mongodb://node0:27017
[OVERALL], RunTime(ms), 3327
[OVERALL], Throughput(ops/sec), 3005.710850616171
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2141.0
[CLEANUP], MinLatency(us), 2140
[CLEANUP], MaxLatency(us), 2141
[CLEANUP], 95thPercentileLatency(us), 2141
[CLEANUP], 99thPercentileLatency(us), 2141
[INSERT], Operations, 10000
[INSERT], AverageLatency(us), 272.9379
[INSERT], MinLatency(us), 154
[INSERT], MaxLatency(us), 122047
[INSERT], 95thPercentileLatency(us), 501
[INSERT], 99thPercentileLatency(us), 873
[INSERT], Return=OK, 10000