cloudlab_scripts/mongo_journal_benchmark/load5000.out
mongo client connection created with mongodb://node0:27017
[OVERALL], RunTime(ms), 2392
[OVERALL], Throughput(ops/sec), 2090.3010033444816
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2477.0
[CLEANUP], MinLatency(us), 2476
[CLEANUP], MaxLatency(us), 2477
[CLEANUP], 95thPercentileLatency(us), 2477
[CLEANUP], 99thPercentileLatency(us), 2477
[INSERT], Operations, 5000
[INSERT], AverageLatency(us), 357.6498
[INSERT], MinLatency(us), 209
[INSERT], MaxLatency(us), 122367
[INSERT], 95thPercentileLatency(us), 653
[INSERT], 99thPercentileLatency(us), 1020
[INSERT], Return=OK, 5000