cloudlab_scripts/mongo_journal_benchmark/load5000_j.out
mongo client connection created with mongodb://node0:27017
[OVERALL], RunTime(ms), 2341
[OVERALL], Throughput(ops/sec), 2135.839384878257
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2595.0
[CLEANUP], MinLatency(us), 2594
[CLEANUP], MaxLatency(us), 2595
[CLEANUP], 95thPercentileLatency(us), 2595
[CLEANUP], 99thPercentileLatency(us), 2595
[INSERT], Operations, 5000
[INSERT], AverageLatency(us), 352.0208
[INSERT], MinLatency(us), 209
[INSERT], MaxLatency(us), 102847
[INSERT], 95thPercentileLatency(us), 678
[INSERT], 99thPercentileLatency(us), 1114
[INSERT], Return=OK, 5000