cloudlab_scripts/mongo_journal_benchmark/update1_insert9_5000.out
mongo client connection created with mongodb://node0:27017
[OVERALL], RunTime(ms), 2418
[OVERALL], Throughput(ops/sec), 2067.8246484698097
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2465.0
[CLEANUP], MinLatency(us), 2464
[CLEANUP], MaxLatency(us), 2465
[CLEANUP], 95thPercentileLatency(us), 2465
[CLEANUP], 99thPercentileLatency(us), 2465
[INSERT], Operations, 4521
[INSERT], AverageLatency(us), 348.5684583056846
[INSERT], MinLatency(us), 190
[INSERT], MaxLatency(us), 81599
[INSERT], 95thPercentileLatency(us), 670
[INSERT], 99thPercentileLatency(us), 1614
[INSERT], Return=OK, 4521
[UPDATE], Operations, 479
[UPDATE], AverageLatency(us), 435.5594989561587
[UPDATE], MinLatency(us), 254
[UPDATE], MaxLatency(us), 9975
[UPDATE], 95thPercentileLatency(us), 821
[UPDATE], 99thPercentileLatency(us), 1093
[UPDATE], Return=OK, 479