cloudlab_scripts/mongo_journal_benchmark/update1_insert9_5000_j.out
mongo client connection created with mongodb://node0:27017
[OVERALL], RunTime(ms), 2443
[OVERALL], Throughput(ops/sec), 2046.6639377814163
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2465.0
[CLEANUP], MinLatency(us), 2464
[CLEANUP], MaxLatency(us), 2465
[CLEANUP], 95thPercentileLatency(us), 2465
[CLEANUP], 99thPercentileLatency(us), 2465
[INSERT], Operations, 4473
[INSERT], AverageLatency(us), 348.7531857813548
[INSERT], MinLatency(us), 210
[INSERT], MaxLatency(us), 61503
[INSERT], 95thPercentileLatency(us), 725
[INSERT], 99thPercentileLatency(us), 1147
[INSERT], Return=OK, 4473
[UPDATE], Operations, 527
[UPDATE], AverageLatency(us), 456.9259962049336
[UPDATE], MinLatency(us), 270
[UPDATE], MaxLatency(us), 9535
[UPDATE], 95thPercentileLatency(us), 977
[UPDATE], 99thPercentileLatency(us), 1432
[UPDATE], Return=OK, 527