cloudlab_scripts/mongo_journal_benchmark/update5_insert5_5000.out
mongo client connection created with mongodb://node0:27017
[OVERALL], RunTime(ms), 2400
[OVERALL], Throughput(ops/sec), 2083.3333333333335
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2415.0
[CLEANUP], MinLatency(us), 2414
[CLEANUP], MaxLatency(us), 2415
[CLEANUP], 95thPercentileLatency(us), 2415
[CLEANUP], 99thPercentileLatency(us), 2415
[INSERT], Operations, 2490
[INSERT], AverageLatency(us), 343.16626506024096
[INSERT], MinLatency(us), 203
[INSERT], MaxLatency(us), 71423
[INSERT], 95thPercentileLatency(us), 743
[INSERT], 99thPercentileLatency(us), 1083
[INSERT], Return=OK, 2490
[UPDATE], Operations, 2510
[UPDATE], AverageLatency(us), 380.2788844621514
[UPDATE], MinLatency(us), 241
[UPDATE], MaxLatency(us), 4847
[UPDATE], 95thPercentileLatency(us), 883
[UPDATE], 99thPercentileLatency(us), 1313
[UPDATE], Return=OK, 2510