cloudlab_scripts/mongo_journal_benchmark/update5_insert5_5000_j.out
mongo client connection created with mongodb://node0:27017
[OVERALL], RunTime(ms), 2589
[OVERALL], Throughput(ops/sec), 1931.2475859405176
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2385.0
[CLEANUP], MinLatency(us), 2384
[CLEANUP], MaxLatency(us), 2385
[CLEANUP], 95thPercentileLatency(us), 2385
[CLEANUP], 99thPercentileLatency(us), 2385
[INSERT], Operations, 2483
[INSERT], AverageLatency(us), 371.4869109947644
[INSERT], MinLatency(us), 211
[INSERT], MaxLatency(us), 70015
[INSERT], 95thPercentileLatency(us), 792
[INSERT], 99thPercentileLatency(us), 1141
[INSERT], Return=OK, 2483
[UPDATE], Operations, 2517
[UPDATE], AverageLatency(us), 391.67699642431467
[UPDATE], MinLatency(us), 245
[UPDATE], MaxLatency(us), 4827
[UPDATE], 95thPercentileLatency(us), 923
[UPDATE], 99thPercentileLatency(us), 1210
[UPDATE], Return=OK, 2517