cloudlab_scripts/mongo_journal_benchmark/update9_insert1_5000.out
mongo client connection created with mongodb://node0:27017
[OVERALL], RunTime(ms), 2692
[OVERALL], Throughput(ops/sec), 1857.3551263001486
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2445.0
[CLEANUP], MinLatency(us), 2444
[CLEANUP], MaxLatency(us), 2445
[CLEANUP], 95thPercentileLatency(us), 2445
[CLEANUP], 99thPercentileLatency(us), 2445
[UPDATE], Operations, 4477
[UPDATE], AverageLatency(us), 412.1952200134018
[UPDATE], MinLatency(us), 221
[UPDATE], MaxLatency(us), 77439
[UPDATE], 95thPercentileLatency(us), 960
[UPDATE], 99thPercentileLatency(us), 1326
[UPDATE], Return=OK, 4477
[INSERT], Operations, 523
[INSERT], AverageLatency(us), 375.24856596558317
[INSERT], MinLatency(us), 195
[INSERT], MaxLatency(us), 4151
[INSERT], 95thPercentileLatency(us), 814
[INSERT], 99thPercentileLatency(us), 1765
[INSERT], Return=OK, 523